; ModuleID = '/users/gxyang/rcsm-rmm/verification/rmm.linked.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.buffer_alloc_ctx = type { i8*, i64, %struct._memory_header*, %struct._memory_header*, i32 }
%struct._memory_header = type { i64, i64, i64, %struct._memory_header*, %struct._memory_header*, %struct._memory_header*, %struct._memory_header*, i64 }
%struct.spinlock_t = type { i32 }
%struct.gic_cpu_state = type { [4 x i64], [4 x i64], i64, i64, [16 x i64], i64 }
%struct.smc_handler = type { i8*, i32, i64 ()*, i64 (i64)*, i64 (i64, i64)*, i64 (i64, i64, i64)*, i64 (i64, i64, i64, i64)*, void (i64, %struct.smc_result*)*, void (i64, i64, %struct.smc_result*)*, void (i64, i64, i64, %struct.smc_result*)*, void (i64, i64, i64, i64, %struct.smc_result*)*, i8, i8 }
%struct.smc_result = type { i64, i64, i64, i64 }
%struct.rmm_trap_element = type { i64, i64 }
%struct.sysreg_handler = type { i64, i64, i1 (%struct.rec*, %struct.rec_exit*, i64)* }
%struct.rec = type { %struct.granule*, i64, i8, [31 x i64], i64, i64, %struct.sysreg_state, %struct.common_sysreg_state, %struct.anon.1, %struct.anon.0, %struct.anon.1.2, %union.anon.3, %struct.fpu_state, %struct.ns_state*, %struct.anon.3, i64, i64, %struct.realm_s1_context }
%struct.granule = type { %struct.spinlock_t, i32, %union.anon.3 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "heap", scope: !2, file: !3, line: 93, type: !24, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !23, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/lib/memory_buffer_alloc.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "4d3885a2037d292ba7de835a1e7a5833")
!4 = !{!5, !8, !20, !21}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 46, baseType: !7)
!6 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!7 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "memory_header", file: !3, line: 62, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_memory_header", file: !3, line: 63, size: 512, elements: !11)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "magic1", scope: !10, file: !3, line: 65, baseType: !5, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !10, file: !3, line: 66, baseType: !5, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !10, file: !3, line: 67, baseType: !5, size: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !10, file: !3, line: 68, baseType: !8, size: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !3, line: 69, baseType: !8, size: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev_free", scope: !10, file: !3, line: 70, baseType: !8, size: 64, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !10, file: !3, line: 71, baseType: !8, size: 64, offset: 384)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "magic2", scope: !10, file: !3, line: 72, baseType: !5, size: 64, offset: 448)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !{!0}
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 5120, elements: !34)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffer_alloc_ctx", file: !3, line: 91, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 75, size: 320, elements: !27)
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !26, file: !3, line: 77, baseType: !21, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !3, line: 78, baseType: !5, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !26, file: !3, line: 79, baseType: !8, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "first_free", scope: !26, file: !3, line: 80, baseType: !8, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !26, file: !3, line: 81, baseType: !33, size: 32, offset: 256)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !{!35}
!35 = !DISubrange(count: 16)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "debug_exits", scope: !38, file: !39, line: 22, type: !43, isLocal: false, isDefinition: true)
!38 = distinct !DICompileUnit(language: DW_LANG_C99, file: !39, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, globals: !57, splitDebugInlining: false, nameTableKind: None)
!39 = !DIFile(filename: "src/core/exit.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "4d625bc8a5af8aada1033320c00547a4")
!40 = !{!41, !52}
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "granule_state", file: !42, line: 59, baseType: !43, size: 32, elements: !44)
!42 = !DIFile(filename: "include/granule_types.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "110cc7c9f06f18f837889ef2bb112fb9")
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !{!45, !46, !47, !48, !49, !50, !51}
!45 = !DIEnumerator(name: "GRANULE_STATE_NS", value: 0)
!46 = !DIEnumerator(name: "GRANULE_STATE_DELEGATED", value: 1)
!47 = !DIEnumerator(name: "GRANULE_STATE_RD", value: 2)
!48 = !DIEnumerator(name: "GRANULE_STATE_REC", value: 3)
!49 = !DIEnumerator(name: "GRANULE_STATE_DATA", value: 4)
!50 = !DIEnumerator(name: "GRANULE_STATE_RTT", value: 5)
!51 = !DIEnumerator(name: "GRANULE_STATE_ANY", value: 6)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ripas", file: !53, line: 16, baseType: !43, size: 32, elements: !54)
!53 = !DIFile(filename: "include/ripas.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "49ebdb27497501bdcf3409d01aafdb59")
!54 = !{!55, !56}
!55 = !DIEnumerator(name: "RIPAS_EMPTY", value: 0)
!56 = !DIEnumerator(name: "RIPAS_RAM", value: 1)
!57 = !{!36}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "vmid_count", scope: !60, file: !61, line: 26, type: !43, isLocal: true, isDefinition: true)
!60 = distinct !DICompileUnit(language: DW_LANG_C99, file: !61, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !62, splitDebugInlining: false, nameTableKind: None)
!61 = !DIFile(filename: "src/core/vmid.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "a9e29b794084fe55fc7e2d7b6d92c7ab")
!62 = !{!63, !58, !68}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "vmids", scope: !60, file: !61, line: 21, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 65536, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 1024)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "vmid_lock", scope: !60, file: !61, line: 32, type: !70, isLocal: true, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !71, line: 14, baseType: !72)
!71 = !DIFile(filename: "include/spinlock.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "eb57194eb37924a1c83761383155c07f")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 12, size: 32, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !72, file: !71, line: 13, baseType: !43, size: 32)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "nr_lrs", scope: !77, file: !78, line: 6, type: !33, isLocal: true, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !79, splitDebugInlining: false, nameTableKind: None)
!78 = !DIFile(filename: "src/core/gic.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "6ff03619721f94bac270e2187b1ab9e9")
!79 = !{!75, !80, !82, !84, !86, !88}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "nr_aprs", scope: !77, file: !78, line: 7, type: !33, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "nr_pri_bits", scope: !77, file: !78, line: 8, type: !7, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "pri_res0_mask", scope: !77, file: !78, line: 9, type: !7, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "max_vintid", scope: !77, file: !78, line: 10, type: !7, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "default_gicstate", scope: !77, file: !78, line: 11, type: !90, isLocal: true, isDefinition: true)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gic_cpu_state", file: !91, line: 136, size: 1728, elements: !92)
!91 = !DIFile(filename: "include/gic.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "f2832ac8e1d83d871176713ddcea385c")
!92 = !{!93, !97, !98, !99, !100, !102}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ich_ap0r", scope: !90, file: !91, line: 137, baseType: !94, size: 256)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 4)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ich_ap1r", scope: !90, file: !91, line: 138, baseType: !94, size: 256, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ich_vmcr", scope: !90, file: !91, line: 139, baseType: !7, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ich_hcr", scope: !90, file: !91, line: 140, baseType: !7, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ich_lr", scope: !90, file: !91, line: 143, baseType: !101, size: 1024, offset: 640)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !34)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ich_misr", scope: !90, file: !91, line: 144, baseType: !7, size: 64, offset: 1664)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "status_handler", scope: !105, file: !106, line: 20, type: !198, isLocal: false, isDefinition: true)
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !107, globals: !119, splitDebugInlining: false, nameTableKind: None)
!106 = !DIFile(filename: "src/core/handler.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "815f84669e21c1bdc4f15c50963e01c4")
!107 = !{!108}
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rmi_type", file: !106, line: 60, baseType: !43, size: 32, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118}
!110 = !DIEnumerator(name: "rmi_type_0", value: 0)
!111 = !DIEnumerator(name: "rmi_type_1", value: 1)
!112 = !DIEnumerator(name: "rmi_type_2", value: 2)
!113 = !DIEnumerator(name: "rmi_type_3", value: 3)
!114 = !DIEnumerator(name: "rmi_type_4", value: 4)
!115 = !DIEnumerator(name: "rmi_type_1_o", value: 5)
!116 = !DIEnumerator(name: "rmi_type_2_o", value: 6)
!117 = !DIEnumerator(name: "rmi_type_3_o", value: 7)
!118 = !DIEnumerator(name: "rmi_type_4_o", value: 8)
!119 = !{!103, !120, !129}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "rmm_trap_list", scope: !105, file: !106, line: 533, type: !122, isLocal: false, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 768, elements: !127)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rmm_trap_element", file: !106, line: 503, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "aborted_pc", scope: !123, file: !106, line: 507, baseType: !7, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "new_pc", scope: !123, file: !106, line: 511, baseType: !7, size: 64, offset: 64)
!127 = !{!128}
!128 = !DISubrange(count: 6)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "smc_handlers", scope: !105, file: !106, line: 146, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 18432, elements: !196)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smc_handler", file: !106, line: 72, size: 768, elements: !134)
!134 = !{!135, !139, !140, !145, !150, !155, !160, !165, !178, !183, !188, !193, !195}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fn_name", scope: !133, file: !106, line: 73, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !106, line: 74, baseType: !108, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "f0", scope: !133, file: !106, line: 75, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_0", file: !106, line: 44, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!7}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !133, file: !106, line: 76, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_1", file: !106, line: 45, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!7, !7}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !133, file: !106, line: 77, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_2", file: !106, line: 46, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!7, !7, !7}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !133, file: !106, line: 78, baseType: !156, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_3", file: !106, line: 47, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!7, !7, !7, !7}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "f4", scope: !133, file: !106, line: 79, baseType: !161, size: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_4", file: !106, line: 49, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!7, !7, !7, !7, !7}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f1_o", scope: !133, file: !106, line: 80, baseType: !166, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_1_o", file: !106, line: 51, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !7, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smc_result", file: !172, line: 224, size: 256, elements: !173)
!172 = !DIFile(filename: "include/smc.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "0241a8d167d2256f8f29d0f0ef847683")
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !171, file: !172, line: 225, baseType: !7, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !171, file: !172, line: 226, baseType: !7, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !171, file: !172, line: 227, baseType: !7, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "x3", scope: !171, file: !172, line: 228, baseType: !7, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "f2_o", scope: !133, file: !106, line: 81, baseType: !179, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_2_o", file: !106, line: 52, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !7, !7, !170}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "f3_o", scope: !133, file: !106, line: 82, baseType: !184, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_3_o", file: !106, line: 54, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !7, !7, !7, !170}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "f4_o", scope: !133, file: !106, line: 83, baseType: !189, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "handler_4_o", file: !106, line: 56, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !7, !7, !7, !7, !170}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "log_exec", scope: !133, file: !106, line: 84, baseType: !194, size: 8, offset: 704)
!194 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !133, file: !106, line: 85, baseType: !194, size: 8, offset: 712)
!196 = !{!197}
!197 = !DISubrange(count: 24)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 640, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 10)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "sysreg_handlers", scope: !203, file: !204, line: 105, type: !206, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, globals: !205, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "src/core/sysregs.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "43c79e1239304897d2ff2173362e302e")
!205 = !{!201}
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 576, elements: !385)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysreg_handler", file: !204, line: 96, size: 192, elements: !209)
!209 = !{!210, !211, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "esr_mask", scope: !208, file: !204, line: 97, baseType: !7, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "esr_value", scope: !208, file: !204, line: 98, baseType: !7, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !208, file: !204, line: 99, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "sysreg_handler_fn", file: !204, line: 94, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!194, !217, !358, !7}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rec", file: !219, line: 126, size: 12416, elements: !220)
!219 = !DIFile(filename: "include/rec.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "2f2b61ae14147b5b90f53d0a9fc8484b")
!220 = !{!221, !236, !237, !238, !242, !243, !244, !298, !304, !311, !317, !324, !328, !339, !347, !351, !352, !353}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "g_rec", scope: !218, file: !219, line: 127, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "granule", file: !42, line: 159, size: 128, elements: !224)
!224 = !{!225, !230, !231}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !42, line: 164, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !71, line: 14, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 12, size: 32, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !227, file: !71, line: 13, baseType: !43, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !223, file: !42, line: 169, baseType: !41, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !223, file: !42, line: 193, baseType: !232, size: 64, offset: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !42, line: 190, size: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !232, file: !42, line: 191, baseType: !7, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_addr", scope: !232, file: !42, line: 192, baseType: !7, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rec_idx", scope: !218, file: !219, line: 128, baseType: !7, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "runnable", scope: !218, file: !219, line: 129, baseType: !194, size: 8, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !218, file: !219, line: 131, baseType: !239, size: 1984, offset: 192)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1984, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 31)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !218, file: !219, line: 132, baseType: !7, size: 64, offset: 2176)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pstate", scope: !218, file: !219, line: 133, baseType: !7, size: 64, offset: 2240)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sysregs", scope: !218, file: !219, line: 135, baseType: !245, size: 4416, offset: 2304)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysreg_state", file: !219, line: 32, size: 4416, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !293, !294, !295, !296, !297}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sp_el0", scope: !245, file: !219, line: 33, baseType: !7, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sp_el1", scope: !245, file: !219, line: 34, baseType: !7, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "elr_el1", scope: !245, file: !219, line: 35, baseType: !7, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "spsr_el1", scope: !245, file: !219, line: 36, baseType: !7, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pmcr_el0", scope: !245, file: !219, line: 37, baseType: !7, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pmuserenr_el0", scope: !245, file: !219, line: 38, baseType: !7, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tpidrro_el0", scope: !245, file: !219, line: 39, baseType: !7, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tpidr_el0", scope: !245, file: !219, line: 40, baseType: !7, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "csselr_el1", scope: !245, file: !219, line: 41, baseType: !7, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sctlr_el1", scope: !245, file: !219, line: 42, baseType: !7, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "actlr_el1", scope: !245, file: !219, line: 43, baseType: !7, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cpacr_el1", scope: !245, file: !219, line: 44, baseType: !7, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "zcr_el1", scope: !245, file: !219, line: 45, baseType: !7, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ttbr0_el1", scope: !245, file: !219, line: 46, baseType: !7, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ttbr1_el1", scope: !245, file: !219, line: 47, baseType: !7, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tcr_el1", scope: !245, file: !219, line: 48, baseType: !7, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "esr_el1", scope: !245, file: !219, line: 49, baseType: !7, size: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "afsr0_el1", scope: !245, file: !219, line: 50, baseType: !7, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "afsr1_el1", scope: !245, file: !219, line: 51, baseType: !7, size: 64, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "far_el1", scope: !245, file: !219, line: 52, baseType: !7, size: 64, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mair_el1", scope: !245, file: !219, line: 53, baseType: !7, size: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vbar_el1", scope: !245, file: !219, line: 54, baseType: !7, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "contextidr_el1", scope: !245, file: !219, line: 55, baseType: !7, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tpidr_el1", scope: !245, file: !219, line: 56, baseType: !7, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "amair_el1", scope: !245, file: !219, line: 57, baseType: !7, size: 64, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cntkctl_el1", scope: !245, file: !219, line: 58, baseType: !7, size: 64, offset: 1600)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "par_el1", scope: !245, file: !219, line: 59, baseType: !7, size: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mdscr_el1", scope: !245, file: !219, line: 60, baseType: !7, size: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mdccint_el1", scope: !245, file: !219, line: 61, baseType: !7, size: 64, offset: 1792)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "disr_el1", scope: !245, file: !219, line: 62, baseType: !7, size: 64, offset: 1856)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mpam0_el1", scope: !245, file: !219, line: 63, baseType: !7, size: 64, offset: 1920)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cnthctl_el2", scope: !245, file: !219, line: 66, baseType: !7, size: 64, offset: 1984)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cntvoff_el2", scope: !245, file: !219, line: 67, baseType: !7, size: 64, offset: 2048)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cntp_ctl_el0", scope: !245, file: !219, line: 68, baseType: !7, size: 64, offset: 2112)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cntp_cval_el0", scope: !245, file: !219, line: 69, baseType: !7, size: 64, offset: 2176)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cntv_ctl_el0", scope: !245, file: !219, line: 70, baseType: !7, size: 64, offset: 2240)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cntv_cval_el0", scope: !245, file: !219, line: 71, baseType: !7, size: 64, offset: 2304)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "gicstate", scope: !245, file: !219, line: 74, baseType: !285, size: 1728, offset: 2368)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gic_cpu_state", file: !91, line: 136, size: 1728, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ich_ap0r", scope: !285, file: !91, line: 137, baseType: !94, size: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ich_ap1r", scope: !285, file: !91, line: 138, baseType: !94, size: 256, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ich_vmcr", scope: !285, file: !91, line: 139, baseType: !7, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ich_hcr", scope: !285, file: !91, line: 140, baseType: !7, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ich_lr", scope: !285, file: !91, line: 143, baseType: !101, size: 1024, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ich_misr", scope: !285, file: !91, line: 144, baseType: !7, size: 64, offset: 1664)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vmpidr_el2", scope: !245, file: !219, line: 80, baseType: !7, size: 64, offset: 4096)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "hcr_el2", scope: !245, file: !219, line: 81, baseType: !7, size: 64, offset: 4160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cptr_el2", scope: !245, file: !219, line: 84, baseType: !7, size: 64, offset: 4224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tcr_el2", scope: !245, file: !219, line: 85, baseType: !7, size: 64, offset: 4288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sctlr_el2", scope: !245, file: !219, line: 86, baseType: !7, size: 64, offset: 4352)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "common_sysregs", scope: !218, file: !219, line: 136, baseType: !299, size: 192, offset: 6720)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "common_sysreg_state", file: !219, line: 93, size: 192, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vttbr_el2", scope: !299, file: !219, line: 94, baseType: !7, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vtcr_el2", scope: !299, file: !219, line: 95, baseType: !7, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "hcr_el2_common_flags", scope: !299, file: !219, line: 96, baseType: !7, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set_ripas", scope: !218, file: !219, line: 144, baseType: !305, size: 256, offset: 6912)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !219, line: 139, size: 256, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !305, file: !219, line: 140, baseType: !7, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !305, file: !219, line: 141, baseType: !7, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !305, file: !219, line: 142, baseType: !7, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ripas", scope: !305, file: !219, line: 143, baseType: !52, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dispose_info", scope: !218, file: !219, line: 150, baseType: !312, size: 192, offset: 7168)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !219, line: 146, size: 192, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !312, file: !219, line: 147, baseType: !194, size: 8)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !312, file: !219, line: 148, baseType: !7, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !312, file: !219, line: 149, baseType: !7, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "realm_info", scope: !218, file: !219, line: 159, baseType: !318, size: 256, offset: 7360)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !219, line: 154, size: 256, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "par_base", scope: !318, file: !219, line: 155, baseType: !7, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "par_size", scope: !318, file: !219, line: 156, baseType: !7, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "par_end", scope: !318, file: !219, line: 157, baseType: !7, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "g_rd", scope: !318, file: !219, line: 158, baseType: !222, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "last_run_info", scope: !218, file: !219, line: 170, baseType: !325, size: 64, offset: 7616)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !219, line: 161, size: 64, elements: !326)
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "esr", scope: !325, file: !219, line: 169, baseType: !7, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fpu", scope: !218, file: !219, line: 173, baseType: !329, size: 4352, offset: 7680)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fpu_state", file: !219, line: 99, size: 4352, elements: !330)
!330 = !{!331, !336, !337, !338}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !329, file: !219, line: 100, baseType: !332, size: 4096)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 4096, elements: !334)
!333 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!334 = !{!335}
!335 = !DISubrange(count: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fpsr", scope: !329, file: !219, line: 101, baseType: !7, size: 64, offset: 4096)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fpcr", scope: !329, file: !219, line: 102, baseType: !7, size: 64, offset: 4160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !329, file: !219, line: 103, baseType: !194, size: 8, offset: 4224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !218, file: !219, line: 176, baseType: !340, size: 64, offset: 12032)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_state", file: !219, line: 114, size: 8960, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sysregs", scope: !341, file: !219, line: 115, baseType: !245, size: 4416)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sp_el0", scope: !341, file: !219, line: 116, baseType: !7, size: 64, offset: 4416)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "icc_sre_el2", scope: !341, file: !219, line: 117, baseType: !7, size: 64, offset: 4480)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fpu", scope: !341, file: !219, line: 118, baseType: !329, size: 4352, offset: 4608)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "psci_info", scope: !218, file: !219, line: 187, baseType: !348, size: 8, offset: 12096)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !219, line: 178, size: 8, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !348, file: !219, line: 186, baseType: !194, size: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "is_pico", scope: !218, file: !219, line: 190, baseType: !7, size: 64, offset: 12160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !218, file: !219, line: 191, baseType: !7, size: 64, offset: 12224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "s1_ctx", scope: !218, file: !219, line: 193, baseType: !354, size: 128, offset: 12288)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "realm_s1_context", file: !219, line: 121, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "g_ttbr0", scope: !354, file: !219, line: 122, baseType: !222, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "g_ttbr1", scope: !354, file: !219, line: 123, baseType: !222, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rec_exit", file: !360, line: 203, size: 2432, elements: !361)
!360 = !DIFile(filename: "include/smc-rmi.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "2c9c700d1f2b456e85fdf012474fa129")
!361 = !{!362, !363, !364, !365, !366, !367, !371, !372, !373, !374, !375, !376, !383, !384}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "exit_reason", scope: !359, file: !360, line: 204, baseType: !7, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "esr", scope: !359, file: !360, line: 205, baseType: !7, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "far", scope: !359, file: !360, line: 206, baseType: !7, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hpfar", scope: !359, file: !360, line: 207, baseType: !7, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "emulated_write_val", scope: !359, file: !360, line: 208, baseType: !7, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gprs", scope: !359, file: !360, line: 209, baseType: !368, size: 448, offset: 320)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 448, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 7)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "target_rec", scope: !359, file: !360, line: 210, baseType: !7, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "disposed_addr", scope: !359, file: !360, line: 211, baseType: !7, size: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "disposed_size", scope: !359, file: !360, line: 212, baseType: !7, size: 64, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gicv3_vmcr", scope: !359, file: !360, line: 213, baseType: !7, size: 64, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gicv3_misr", scope: !359, file: !360, line: 214, baseType: !7, size: 64, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timer_info", scope: !359, file: !360, line: 220, baseType: !377, size: 256, offset: 1088)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !360, line: 215, size: 256, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cntv_ctl", scope: !377, file: !360, line: 216, baseType: !7, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "cntv_cval", scope: !377, file: !360, line: 217, baseType: !7, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cntp_ctl", scope: !377, file: !360, line: 218, baseType: !7, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cntp_cval", scope: !377, file: !360, line: 219, baseType: !7, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gicv3_lrs", scope: !359, file: !360, line: 221, baseType: !101, size: 1024, offset: 1344)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gicv3_hcr", scope: !359, file: !360, line: 222, baseType: !7, size: 64, offset: 2368)
!385 = !{!386}
!386 = !DISubrange(count: 3)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "tt_l3_buffer", scope: !389, file: !390, line: 59, type: !412, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !405, globals: !408, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "src/core/buffer.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "011ace9d106da36eb4f078302e790dd6")
!391 = !{!392, !41}
!392 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "buffer_slot", file: !393, line: 7, baseType: !43, size: 32, elements: !394)
!393 = !DIFile(filename: "include/buffer.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "4566bd890f33ee7185ee6ff99c642c57")
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!395 = !DIEnumerator(name: "SLOT_NS", value: 0)
!396 = !DIEnumerator(name: "SLOT_DELEGATED", value: 1)
!397 = !DIEnumerator(name: "SLOT_RD", value: 2)
!398 = !DIEnumerator(name: "SLOT_REC", value: 3)
!399 = !DIEnumerator(name: "SLOT_REC2", value: 4)
!400 = !DIEnumerator(name: "SLOT_REC_TARGET", value: 5)
!401 = !DIEnumerator(name: "SLOT_RTT", value: 6)
!402 = !DIEnumerator(name: "SLOT_RTT2", value: 7)
!403 = !DIEnumerator(name: "SLOT_RSI_CALL", value: 8)
!404 = !DIEnumerator(name: "NR_CPU_SLOTS", value: 9)
!405 = !{!7, !20, !406}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !407, line: 98, baseType: !7)
!407 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "65478c86519fc5f031066ff00d1e57d5")
!408 = !{!409, !418, !420, !422, !424, !426, !428, !430, !435, !387}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "tt_l2_buffer", scope: !389, file: !390, line: 62, type: !411, isLocal: false, isDefinition: true)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s1tt", file: !390, line: 55, size: 32768, align: 32768, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "s1tte", scope: !412, file: !390, line: 56, baseType: !415, size: 32768)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 32768, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 512)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "tt_l2_mem0_0", scope: !389, file: !390, line: 75, type: !412, isLocal: false, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "tt_l2_mem0_1", scope: !389, file: !390, line: 77, type: !412, isLocal: false, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "tt_l2_mem1_0", scope: !389, file: !390, line: 80, type: !412, isLocal: false, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "tt_l2_mem1_1", scope: !389, file: !390, line: 82, type: !412, isLocal: false, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "tt_l2_mem1_2", scope: !389, file: !390, line: 84, type: !412, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "tt_l2_mem1_3", scope: !389, file: !390, line: 86, type: !412, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "tt_l3_mem0", scope: !389, file: !390, line: 69, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 33554432, align: 32768, elements: !433)
!433 = !{!434, !417}
!434 = !DISubrange(count: 2)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "tt_l3_mem1", scope: !389, file: !390, line: 72, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 67108864, align: 32768, elements: !438)
!438 = !{!96, !417}
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "mbedtls_mem_buf", scope: !441, file: !442, line: 11, type: !448, isLocal: true, isDefinition: true, align: 32768)
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, globals: !447, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "src/core/crypto.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "110c04212a1744048b74afcf4afffb7d")
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_status_t", file: !445, line: 62, baseType: !446)
!445 = !DIFile(filename: "mbedtls/include/psa/crypto_types.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "a790d4127524d85b8b9ce524dab25960")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !407, line: 167, baseType: !33)
!447 = !{!439}
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 3145728, elements: !450)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !407, line: 226, baseType: !22)
!450 = !{!451}
!451 = !DISubrange(count: 393216)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "granules", scope: !454, file: !455, line: 18, type: !458, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !456, retainedTypes: !144, globals: !457, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "src/core/granule.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "9212888a8e5579e276e4cf1245502311")
!456 = !{!41, !392}
!457 = !{!452}
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 201326592, elements: !472)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "granule", file: !42, line: 159, size: 128, elements: !460)
!460 = !{!461, !466, !467}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !459, file: !42, line: 164, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !71, line: 14, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 12, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !463, file: !71, line: 13, baseType: !43, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !459, file: !42, line: 169, baseType: !41, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !459, file: !42, line: 193, baseType: !468, size: 64, offset: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !459, file: !42, line: 190, size: 64, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !468, file: !42, line: 191, baseType: !7, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_addr", scope: !468, file: !42, line: 192, baseType: !7, size: 64)
!472 = !{!473}
!473 = !DISubrange(count: 1572864)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "rmm_attest_signing_key", scope: !476, file: !477, line: 35, type: !500, isLocal: true, isDefinition: true)
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !478, globals: !487, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "src/rsi/attestation_key.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "007477026881d74facb497590ff84173")
!478 = !{!479, !481, !483, !484, !444, !20}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_deprecated_psa_key_usage_t", file: !480, line: 71, baseType: !481)
!480 = !DIFile(filename: "mbedtls/include/psa/crypto_compat.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "6ef278e948129ad289600af5c7c850b1")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_key_usage_t", file: !445, line: 250, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !407, line: 172, baseType: !43)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_algorithm_t", file: !445, line: 105, baseType: !482)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_key_type_t", file: !445, line: 73, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !407, line: 207, baseType: !486)
!486 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!487 = !{!488, !493, !474, !496, !498}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "rmm_attest_public_key", scope: !476, file: !477, line: 41, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 776, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 97)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "rmm_attest_public_key_hash", scope: !476, file: !477, line: 48, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 256, elements: !334)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "rmm_attest_public_key_len", scope: !476, file: !477, line: 42, type: !5, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "rmm_attest_public_key_hash_len", scope: !476, file: !477, line: 49, type: !5, isLocal: true, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_key_handle_t", file: !480, line: 43, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_svc_key_id_t", file: !445, line: 227, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_key_id_t", file: !445, line: 224, baseType: !482)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "platform_token_buf", scope: !505, file: !506, line: 27, type: !566, isLocal: true, isDefinition: true, align: 32768)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !507, retainedTypes: !144, globals: !543, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "src/rsi/attestation.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "dacc1e2640a464199d2ebee234f738c4")
!507 = !{!41, !508, !52, !513, !519, !527, !537, !392}
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "measurement_algo", file: !509, line: 26, baseType: !43, size: 32, elements: !510)
!509 = !DIFile(filename: "include/measurement.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "dc161d91f97f7d0b607528980b411114")
!510 = !{!511, !512}
!511 = !DIEnumerator(name: "MEASUREMENT_ALGO_ZERO", value: 0)
!512 = !DIEnumerator(name: "MEASUREMENT_ALGO_SHA256", value: 1)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "t_cose_crypto_lib_t", file: !514, line: 99, baseType: !43, size: 32, elements: !515)
!514 = !DIFile(filename: "lib/ext/t_cose/inc/t_cose/t_cose_common.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "bf69ea3c73414e3abdd71a2bafe7b2c2")
!515 = !{!516, !517, !518}
!516 = !DIEnumerator(name: "T_COSE_CRYPTO_LIB_UNIDENTIFIED", value: 0)
!517 = !DIEnumerator(name: "T_COSE_CRYPTO_LIB_OPENSSL", value: 1)
!518 = !DIEnumerator(name: "T_COSE_CRYPTO_LIB_PSA", value: 2)
!519 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "attest_token_err_t", file: !520, line: 22, baseType: !43, size: 32, elements: !521)
!520 = !DIFile(filename: "include/token.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "564a6962ccb9b3063fd51d65f3d0b6f9")
!521 = !{!522, !523, !524, !525, !526}
!522 = !DIEnumerator(name: "ATTEST_TOKEN_ERR_SUCCESS", value: 0)
!523 = !DIEnumerator(name: "ATTEST_TOKEN_ERR_TOO_SMALL", value: 1)
!524 = !DIEnumerator(name: "ATTEST_TOKEN_ERR_CBOR_FORMATTING", value: 2)
!525 = !DIEnumerator(name: "ATTEST_TOKEN_ERR_SIGNING_KEY", value: 3)
!526 = !DIEnumerator(name: "ATTEST_TOKEN_ERR_COSE_ERROR", value: 4)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "measurement_slot", file: !509, line: 12, baseType: !43, size: 32, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536}
!529 = !DIEnumerator(name: "MEASUREMENT_SLOT_0", value: 0)
!530 = !DIEnumerator(name: "MEASUREMENT_SLOT_1", value: 1)
!531 = !DIEnumerator(name: "MEASUREMENT_SLOT_2", value: 2)
!532 = !DIEnumerator(name: "MEASUREMENT_SLOT_3", value: 3)
!533 = !DIEnumerator(name: "MEASUREMENT_SLOT_4", value: 4)
!534 = !DIEnumerator(name: "MEASUREMENT_SLOT_5", value: 5)
!535 = !DIEnumerator(name: "MEASUREMENT_SLOT_6", value: 6)
!536 = !DIEnumerator(name: "MEASUREMENT_SLOT_NR", value: 7)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "s2_walk_return", file: !538, line: 188, baseType: !43, size: 32, elements: !539)
!538 = !DIFile(filename: "include/realm.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "5697a51a8bd0366f6513ae686ca95b16")
!539 = !{!540, !541, !542}
!540 = !DIEnumerator(name: "WALK_SUCCESS", value: 0)
!541 = !DIEnumerator(name: "INVALID_WALK_PARAMS", value: 1)
!542 = !DIEnumerator(name: "WALK_FAIL", value: 2)
!543 = !{!544, !503, !553, !558}
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "rmm_platform_token", scope: !505, file: !506, line: 30, type: !546, isLocal: false, isDefinition: true)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "q_useful_buf_c", file: !547, line: 262, size: 128, elements: !548)
!547 = !DIFile(filename: "lib/ext/qcbor/inc/qcbor/UsefulBuf.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "b951e00f13281da5ecd8c923627facf5")
!548 = !{!549, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !546, file: !547, line: 263, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !547, line: 264, baseType: !5, size: 64, offset: 64)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "rmm_realm_token_bufs", scope: !505, file: !506, line: 28, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 524288, elements: !556)
!556 = !{!35, !557}
!557 = !DISubrange(count: 4096)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "identity", scope: !560, file: !506, line: 35, type: !495, isLocal: true, isDefinition: true)
!560 = distinct !DISubprogram(name: "get_realm_identity", scope: !506, file: !506, line: 33, type: !561, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !505, retainedNodes: !565)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563, !564}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!565 = !{}
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 32768, elements: !567)
!567 = !{!557}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "realm_attest_private_key", scope: !570, file: !571, line: 13, type: !576, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !572, globals: !575, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "src/rsi/attestation_key_sample.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "d070ec4c27aef0ff5b37b840e9cdb282")
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_deprecated_psa_ecc_family_t", file: !480, line: 72, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "psa_ecc_family_t", file: !445, line: 84, baseType: !449)
!575 = !{!568}
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 384, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 48)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "src/lib/pas_drv.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "3d945676d19035c7ee23ae5b8c0eee17")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !583, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "src/lib/string.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "0a0a17107cb3e1c0096a2acf7d0eefff")
!583 = !{!584, !5, !136}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !587, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "src/lib/printf.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "9739d88030af29a94fde29f6d82c690a")
!587 = !{!5, !584, !588, !43, !33, !589, !7, !138, !590, !22, !486, !591}
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !407, line: 256, baseType: !7)
!589 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!590 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_fct_wrap_type", file: !586, line: 129, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 126, size: 128, elements: !594)
!594 = !{!595, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fct", scope: !593, file: !586, line: 127, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !138, !20}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !593, file: !586, line: 128, baseType: !20, size: 64, offset: 64)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !602, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "src/lib/strcmp.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "09a7b13bb20542c6b524697deff21534")
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !607, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "src/lib/pl011.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "c6221dd013d4c1d73306d900929d572d")
!607 = !{!20}
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !610, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "src/lib/measurement.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "e5859628fc34168dd9e8568cdf0cc138")
!610 = !{!508}
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !613, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "src/lib/token.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "50e138f6f55a99f701cff083a44cce8a")
!613 = !{!519, !513, !614, !653}
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "t_cose_err_t", file: !514, line: 168, baseType: !43, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!616 = !DIEnumerator(name: "T_COSE_SUCCESS", value: 0)
!617 = !DIEnumerator(name: "T_COSE_ERR_UNSUPPORTED_SIGNING_ALG", value: 1)
!618 = !DIEnumerator(name: "T_COSE_ERR_MAKING_PROTECTED", value: 2)
!619 = !DIEnumerator(name: "T_COSE_ERR_UNSUPPORTED_HASH", value: 3)
!620 = !DIEnumerator(name: "T_COSE_ERR_HASH_GENERAL_FAIL", value: 4)
!621 = !DIEnumerator(name: "T_COSE_ERR_HASH_BUFFER_SIZE", value: 5)
!622 = !DIEnumerator(name: "T_COSE_ERR_SIG_BUFFER_SIZE", value: 6)
!623 = !DIEnumerator(name: "T_COSE_ERR_SIGN1_FORMAT", value: 8)
!624 = !DIEnumerator(name: "T_COSE_ERR_CBOR_NOT_WELL_FORMED", value: 9)
!625 = !DIEnumerator(name: "T_COSE_ERR_PARAMETER_CBOR", value: 10)
!626 = !DIEnumerator(name: "T_COSE_ERR_NO_ALG_ID", value: 11)
!627 = !DIEnumerator(name: "T_COSE_ERR_NO_KID", value: 12)
!628 = !DIEnumerator(name: "T_COSE_ERR_SIG_VERIFY", value: 13)
!629 = !DIEnumerator(name: "T_COSE_ERR_BAD_SHORT_CIRCUIT_KID", value: 14)
!630 = !DIEnumerator(name: "T_COSE_ERR_INVALID_ARGUMENT", value: 15)
!631 = !DIEnumerator(name: "T_COSE_ERR_INSUFFICIENT_MEMORY", value: 16)
!632 = !DIEnumerator(name: "T_COSE_ERR_FAIL", value: 17)
!633 = !DIEnumerator(name: "T_COSE_ERR_TAMPERING_DETECTED", value: 18)
!634 = !DIEnumerator(name: "T_COSE_ERR_UNKNOWN_KEY", value: 19)
!635 = !DIEnumerator(name: "T_COSE_ERR_WRONG_TYPE_OF_KEY", value: 20)
!636 = !DIEnumerator(name: "T_COSE_ERR_SIG_STRUCT", value: 21)
!637 = !DIEnumerator(name: "T_COSE_ERR_SHORT_CIRCUIT_SIG", value: 22)
!638 = !DIEnumerator(name: "T_COSE_ERR_SIG_FAIL", value: 23)
!639 = !DIEnumerator(name: "T_COSE_ERR_CBOR_FORMATTING", value: 24)
!640 = !DIEnumerator(name: "T_COSE_ERR_TOO_SMALL", value: 25)
!641 = !DIEnumerator(name: "T_COSE_ERR_TOO_MANY_PARAMETERS", value: 26)
!642 = !DIEnumerator(name: "T_COSE_ERR_UNKNOWN_CRITICAL_PARAMETER", value: 27)
!643 = !DIEnumerator(name: "T_COSE_ERR_SHORT_CIRCUIT_SIG_DISABLED", value: 28)
!644 = !DIEnumerator(name: "T_COSE_ERR_INCORRECT_KEY_FOR_LIB", value: 29)
!645 = !DIEnumerator(name: "T_COSE_ERR_NON_INTEGER_ALG_ID", value: 30)
!646 = !DIEnumerator(name: "T_COSE_ERR_BAD_CONTENT_TYPE", value: 31)
!647 = !DIEnumerator(name: "T_COSE_ERR_INCORRECTLY_TAGGED", value: 32)
!648 = !DIEnumerator(name: "T_COSE_ERR_EMPTY_KEY", value: 33)
!649 = !DIEnumerator(name: "T_COSE_ERR_DUPLICATE_PARAMETER", value: 34)
!650 = !DIEnumerator(name: "T_COSE_ERR_PARAMETER_NOT_PROTECTED", value: 35)
!651 = !DIEnumerator(name: "T_COSE_ERR_CRIT_PARAMETER", value: 36)
!652 = !DIEnumerator(name: "T_COSE_ERR_TOO_MANY_TAGS", value: 37)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !654, line: 259, baseType: !43, size: 32, elements: !655)
!654 = !DIFile(filename: "lib/ext/qcbor/inc/qcbor/qcbor_common.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "e008994e4bc8efe74e48e2ac849d05a7")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!656 = !DIEnumerator(name: "QCBOR_SUCCESS", value: 0)
!657 = !DIEnumerator(name: "QCBOR_ERR_BUFFER_TOO_SMALL", value: 1)
!658 = !DIEnumerator(name: "QCBOR_ERR_ENCODE_UNSUPPORTED", value: 2)
!659 = !DIEnumerator(name: "QCBOR_ERR_BUFFER_TOO_LARGE", value: 3)
!660 = !DIEnumerator(name: "QCBOR_ERR_ARRAY_NESTING_TOO_DEEP", value: 4)
!661 = !DIEnumerator(name: "QCBOR_ERR_CLOSE_MISMATCH", value: 5)
!662 = !DIEnumerator(name: "QCBOR_ERR_ARRAY_TOO_LONG", value: 6)
!663 = !DIEnumerator(name: "QCBOR_ERR_TOO_MANY_CLOSES", value: 7)
!664 = !DIEnumerator(name: "QCBOR_ERR_ARRAY_OR_MAP_STILL_OPEN", value: 8)
!665 = !DIEnumerator(name: "QCBOR_ERR_BAD_TYPE_7", value: 9)
!666 = !DIEnumerator(name: "QCBOR_ERR_EXTRA_BYTES", value: 10)
!667 = !DIEnumerator(name: "QCBOR_ERR_UNSUPPORTED", value: 11)
!668 = !DIEnumerator(name: "QCBOR_ERR_ARRAY_OR_MAP_UNCONSUMED", value: 12)
!669 = !DIEnumerator(name: "QCBOR_ERR_BAD_INT", value: 13)
!670 = !DIEnumerator(name: "QCBOR_ERR_INDEFINITE_STRING_CHUNK", value: 14)
!671 = !DIEnumerator(name: "QCBOR_ERR_HIT_END", value: 15)
!672 = !DIEnumerator(name: "QCBOR_ERR_BAD_BREAK", value: 16)
!673 = !DIEnumerator(name: "QCBOR_ERR_INPUT_TOO_LARGE", value: 17)
!674 = !DIEnumerator(name: "QCBOR_ERR_ARRAY_DECODE_NESTING_TOO_DEEP", value: 18)
!675 = !DIEnumerator(name: "QCBOR_ERR_ARRAY_DECODE_TOO_LONG", value: 19)
!676 = !DIEnumerator(name: "QCBOR_ERR_STRING_TOO_LONG", value: 20)
!677 = !DIEnumerator(name: "QCBOR_ERR_BAD_EXP_AND_MANTISSA", value: 21)
!678 = !DIEnumerator(name: "QCBOR_ERR_NO_STRING_ALLOCATOR", value: 22)
!679 = !DIEnumerator(name: "QCBOR_ERR_STRING_ALLOCATE", value: 23)
!680 = !DIEnumerator(name: "QCBOR_ERR_TOO_MANY_TAGS", value: 24)
!681 = !DIEnumerator(name: "QCBOR_ERR_MAP_LABEL_TYPE", value: 25)
!682 = !DIEnumerator(name: "QCBOR_ERR_UNEXPECTED_TYPE", value: 26)
!683 = !DIEnumerator(name: "QCBOR_ERR_BAD_TAG_CONTENT", value: 27)
!684 = !DIEnumerator(name: "QCBOR_ERR_BAD_OPT_TAG", value: 27)
!685 = !DIEnumerator(name: "QCBOR_ERR_DUPLICATE_LABEL", value: 28)
!686 = !DIEnumerator(name: "QCBOR_ERR_MEM_POOL_SIZE", value: 29)
!687 = !DIEnumerator(name: "QCBOR_ERR_INT_OVERFLOW", value: 30)
!688 = !DIEnumerator(name: "QCBOR_ERR_DATE_OVERFLOW", value: 31)
!689 = !DIEnumerator(name: "QCBOR_ERR_EXIT_MISMATCH", value: 32)
!690 = !DIEnumerator(name: "QCBOR_ERR_NO_MORE_ITEMS", value: 33)
!691 = !DIEnumerator(name: "QCBOR_ERR_LABEL_NOT_FOUND", value: 34)
!692 = !DIEnumerator(name: "QCBOR_ERR_NUMBER_SIGN_CONVERSION", value: 35)
!693 = !DIEnumerator(name: "QCBOR_ERR_CONVERSION_UNDER_OVER_FLOW", value: 36)
!694 = !DIEnumerator(name: "QCBOR_ERR_MAP_NOT_ENTERED", value: 37)
!695 = !DIEnumerator(name: "QCBOR_ERR_CALLBACK_FAIL", value: 38)
!696 = !DIEnumerator(name: "QCBOR_ERR_FLOAT_DATE_DISABLED", value: 39)
!697 = !DIEnumerator(name: "QCBOR_ERR_HALF_PRECISION_DISABLED", value: 40)
!698 = !DIEnumerator(name: "QCBOR_ERR_HW_FLOAT_DISABLED", value: 41)
!699 = !DIEnumerator(name: "QCBOR_ERR_FLOAT_EXCEPTION", value: 42)
!700 = !DIEnumerator(name: "QCBOR_ERR_INDEF_LEN_STRINGS_DISABLED", value: 43)
!701 = !DIEnumerator(name: "QCBOR_ERR_INDEF_LEN_ARRAYS_DISABLED", value: 44)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "src/rcsm/exit.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "e1bf9a69360f5fde9e30d78124defb6e")
!704 = !{!41, !52, !392}
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !707, retainedTypes: !713, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "src/rcsm/rctt.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "804816a26e7907d1700b6f0d6b55532c")
!707 = !{!41, !52, !392, !508, !708}
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "map_unmap_ns_op", file: !709, line: 35, baseType: !43, size: 32, elements: !710)
!709 = !DIFile(filename: "include/rcsm.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "806cebd8909e89e7846822db1a0ddf0e")
!710 = !{!711, !712}
!711 = !DIEnumerator(name: "MAP_NS", value: 0)
!712 = !DIEnumerator(name: "UNMAP_NS", value: 1)
!713 = !{!7, !714, !52, !43, !406, !20}
!714 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "src/core/init.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "99fa0363120277582ca534d2f22fe70f")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !720, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "src/core/s2tt.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "e65ab7574983381db04be91db871edfe")
!719 = !{!41, !52, !508, !392}
!720 = !{!721, !406, !20}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "src/core/run.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "0eb0da1d7610b0e9a148b16f17b46158")
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !727, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "src/core/realm_access.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "309e61361f8b1d5bf7058a0bbd1fa60c")
!726 = !{!537, !41, !508, !392}
!727 = !{!7, !406, !20}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "src/core/timers.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "a5c083f55ddd707ffd5b0123c578d14f")
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "src/rmi/system.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "0f5599a7c15c46ea40a8b0decf1d5ddf")
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "src/rmi/rec.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "edf7d9977027f755cf4392caa37d42a9")
!734 = !{!7, !20, !406, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "status_t", file: !736, line: 11, baseType: !43)
!736 = !DIFile(filename: "include/status.h", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "d99ed6079269f09f1b4a42d5c091c991")
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !739, retainedTypes: !740, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "src/rmi/run.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "73d6d64fab19d022f9d434a1c762d582")
!739 = !{!41, !52, !392, !508}
!740 = !{!7, !20, !735}
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !743, retainedTypes: !734, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "src/rmi/realm.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "9f78bca5624e1ec83839f87fd484373d")
!743 = !{!41, !508, !392, !527, !52}
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !746, retainedTypes: !747, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "src/rmi/rtt.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "9b6931625a65c98d605aa92e9fa5fd2d")
!746 = !{!41, !508, !52, !392, !708}
!747 = !{!714, !406, !20, !7}
!748 = distinct !DICompileUnit(language: DW_LANG_C99, file: !749, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !456, splitDebugInlining: false, nameTableKind: None)
!749 = !DIFile(filename: "src/rmi/granule.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "b173f3c9f27c7c2cc301d2d0f7f49a9f")
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "src/rsi/psci.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "8d6d7b6e91c759359e98f07e249b8bea")
!752 = !{!43, !7, !20, !406}
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "src/rsi/system.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "0d87deb178e65ce5172c7eaa91e6d6cf")
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !40, retainedTypes: !144, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "src/rsi/dispose.c", directory: "/users/gxyang/rcsm-rmm", checksumkind: CSK_MD5, checksum: "80768c894b8cefdc81fda25d4a047cf9")
!757 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!758 = !{i32 7, !"Dwarf Version", i32 5}
!759 = !{i32 2, !"Debug Info Version", i32 3}
!760 = !{i32 1, !"wchar_size", i32 4}
!761 = !{i32 1, !"branch-target-enforcement", i32 0}
!762 = !{i32 1, !"sign-return-address", i32 0}
!763 = !{i32 1, !"sign-return-address-all", i32 0}
!764 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!765 = !{i32 7, !"PIC Level", i32 2}
!766 = !{i32 7, !"PIE Level", i32 2}
!767 = distinct !DISubprogram(name: "set_pas_realm", scope: !580, file: !580, line: 10, type: !148, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !579, retainedNodes: !565)
!768 = !DILocalVariable(name: "addr", arg: 1, scope: !767, file: !580, line: 10, type: !7)
!769 = !DILocation(line: 0, scope: !767)
!770 = !DILocation(line: 13, column: 9, scope: !767)
!771 = !DILocation(line: 13, column: 2, scope: !767)
!772 = distinct !DISubprogram(name: "set_pas_ns", scope: !580, file: !580, line: 21, type: !773, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !579, retainedNodes: !565)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !7}
!775 = !DILocalVariable(name: "addr", arg: 1, scope: !772, file: !580, line: 21, type: !7)
!776 = !DILocation(line: 0, scope: !772)
!777 = !DILocalVariable(name: "ret", scope: !772, file: !580, line: 23, type: !33)
!778 = !DILocation(line: 26, column: 8, scope: !772)
!779 = !DILocation(line: 33, column: 6, scope: !772)
!780 = !DILocation(line: 37, column: 1, scope: !772)
!781 = distinct !DISubprogram(name: "set_pas_ns_to_any", scope: !580, file: !580, line: 39, type: !773, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !579, retainedNodes: !565)
!782 = !DILocalVariable(name: "addr", arg: 1, scope: !781, file: !580, line: 39, type: !7)
!783 = !DILocation(line: 0, scope: !781)
!784 = !DILocalVariable(name: "ret", scope: !781, file: !580, line: 41, type: !33)
!785 = !DILocation(line: 50, column: 8, scope: !781)
!786 = !DILocation(line: 57, column: 6, scope: !781)
!787 = !DILocation(line: 61, column: 1, scope: !781)
!788 = distinct !DISubprogram(name: "set_pas_any_to_ns", scope: !580, file: !580, line: 63, type: !773, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !579, retainedNodes: !565)
!789 = !DILocalVariable(name: "addr", arg: 1, scope: !788, file: !580, line: 63, type: !7)
!790 = !DILocation(line: 0, scope: !788)
!791 = !DILocalVariable(name: "ret", scope: !788, file: !580, line: 65, type: !33)
!792 = !DILocation(line: 74, column: 8, scope: !788)
!793 = !DILocation(line: 81, column: 6, scope: !788)
!794 = !DILocation(line: 85, column: 1, scope: !788)
!795 = distinct !DISubprogram(name: "memcpy", scope: !582, file: !582, line: 7, type: !796, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !581, retainedNodes: !565)
!796 = !DISubroutineType(types: !797)
!797 = !{!20, !20, !550, !5}
!798 = !DILocalVariable(name: "dest", arg: 1, scope: !795, file: !582, line: 7, type: !20)
!799 = !DILocation(line: 0, scope: !795)
!800 = !DILocalVariable(name: "src", arg: 2, scope: !795, file: !582, line: 7, type: !550)
!801 = !DILocalVariable(name: "n", arg: 3, scope: !795, file: !582, line: 7, type: !5)
!802 = !DILocalVariable(name: "d", scope: !795, file: !582, line: 9, type: !584)
!803 = !DILocalVariable(name: "s", scope: !795, file: !582, line: 10, type: !584)
!804 = !DILocation(line: 12, column: 2, scope: !795)
!805 = !DILocation(line: 12, column: 10, scope: !795)
!806 = !DILocation(line: 13, column: 12, scope: !795)
!807 = !DILocation(line: 13, column: 10, scope: !795)
!808 = !DILocation(line: 13, column: 5, scope: !795)
!809 = !DILocation(line: 13, column: 8, scope: !795)
!810 = distinct !{!810, !804, !806}
!811 = !DILocation(line: 15, column: 2, scope: !795)
!812 = distinct !DISubprogram(name: "memset", scope: !582, file: !582, line: 18, type: !813, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !581, retainedNodes: !565)
!813 = !DISubroutineType(types: !814)
!814 = !{!20, !20, !33, !5}
!815 = !DILocalVariable(name: "s", arg: 1, scope: !812, file: !582, line: 18, type: !20)
!816 = !DILocation(line: 0, scope: !812)
!817 = !DILocalVariable(name: "c", arg: 2, scope: !812, file: !582, line: 18, type: !33)
!818 = !DILocalVariable(name: "n", arg: 3, scope: !812, file: !582, line: 18, type: !5)
!819 = !DILocalVariable(name: "src", scope: !812, file: !582, line: 20, type: !584)
!820 = !DILocation(line: 22, column: 2, scope: !812)
!821 = !DILocation(line: 23, column: 10, scope: !812)
!822 = distinct !{!822, !820, !823, !824}
!823 = !DILocation(line: 23, column: 12, scope: !812)
!824 = !{!"llvm.loop.isvectorized", i32 1}
!825 = !DILocation(line: 22, column: 10, scope: !812)
!826 = !DILocation(line: 23, column: 7, scope: !812)
!827 = distinct !{!827, !820, !823, !824}
!828 = !DILocation(line: 25, column: 2, scope: !812)
!829 = distinct !DISubprogram(name: "memcmp", scope: !582, file: !582, line: 38, type: !830, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !581, retainedNodes: !565)
!830 = !DISubroutineType(types: !831)
!831 = !{!33, !550, !550, !5}
!832 = !DILocalVariable(name: "s1", arg: 1, scope: !829, file: !582, line: 38, type: !550)
!833 = !DILocation(line: 0, scope: !829)
!834 = !DILocalVariable(name: "s2", arg: 2, scope: !829, file: !582, line: 38, type: !550)
!835 = !DILocalVariable(name: "len", arg: 3, scope: !829, file: !582, line: 38, type: !5)
!836 = !DILocalVariable(name: "s", scope: !829, file: !582, line: 40, type: !603)
!837 = !DILocalVariable(name: "d", scope: !829, file: !582, line: 41, type: !603)
!838 = !DILocation(line: 45, column: 2, scope: !829)
!839 = !DILocation(line: 45, column: 12, scope: !829)
!840 = !DILocation(line: 46, column: 10, scope: !841)
!841 = distinct !DILexicalBlock(scope: !829, file: !582, line: 45, column: 16)
!842 = !DILocation(line: 46, column: 8, scope: !841)
!843 = !DILocalVariable(name: "sc", scope: !829, file: !582, line: 42, type: !22)
!844 = !DILocation(line: 47, column: 10, scope: !841)
!845 = !DILocation(line: 47, column: 8, scope: !841)
!846 = !DILocalVariable(name: "dc", scope: !829, file: !582, line: 43, type: !22)
!847 = !DILocation(line: 48, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !841, file: !582, line: 48, column: 7)
!849 = !DILocation(line: 48, column: 12, scope: !848)
!850 = !DILocation(line: 48, column: 10, scope: !848)
!851 = !DILocation(line: 48, column: 7, scope: !841)
!852 = distinct !{!852, !838, !853}
!853 = !DILocation(line: 50, column: 2, scope: !829)
!854 = !DILocation(line: 49, column: 4, scope: !848)
!855 = !DILocation(line: 52, column: 2, scope: !829)
!856 = !DILocation(line: 53, column: 1, scope: !829)
!857 = distinct !DISubprogram(name: "memmove", scope: !582, file: !582, line: 55, type: !796, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !581, retainedNodes: !565)
!858 = !DILocalVariable(name: "dst", arg: 1, scope: !857, file: !582, line: 55, type: !20)
!859 = !DILocation(line: 0, scope: !857)
!860 = !DILocalVariable(name: "src", arg: 2, scope: !857, file: !582, line: 55, type: !550)
!861 = !DILocalVariable(name: "len", arg: 3, scope: !857, file: !582, line: 55, type: !5)
!862 = !DILocation(line: 65, column: 6, scope: !863)
!863 = distinct !DILexicalBlock(scope: !857, file: !582, line: 65, column: 6)
!864 = !DILocation(line: 65, column: 20, scope: !863)
!865 = !DILocation(line: 65, column: 18, scope: !863)
!866 = !DILocation(line: 65, column: 32, scope: !863)
!867 = !DILocation(line: 65, column: 6, scope: !857)
!868 = !DILocation(line: 67, column: 10, scope: !869)
!869 = distinct !DILexicalBlock(scope: !863, file: !582, line: 65, column: 40)
!870 = !DILocation(line: 67, column: 3, scope: !869)
!871 = !DILocalVariable(name: "end", scope: !872, file: !582, line: 70, type: !136)
!872 = distinct !DILexicalBlock(scope: !863, file: !582, line: 68, column: 9)
!873 = !DILocation(line: 0, scope: !872)
!874 = !DILocation(line: 71, column: 37, scope: !872)
!875 = !DILocalVariable(name: "s", scope: !872, file: !582, line: 71, type: !136)
!876 = !DILocation(line: 72, column: 25, scope: !872)
!877 = !DILocalVariable(name: "d", scope: !872, file: !582, line: 72, type: !584)
!878 = !DILocation(line: 74, column: 12, scope: !872)
!879 = !DILocation(line: 74, column: 3, scope: !872)
!880 = !DILocation(line: 75, column: 12, scope: !872)
!881 = !DILocation(line: 75, column: 11, scope: !872)
!882 = !DILocation(line: 75, column: 5, scope: !872)
!883 = !DILocation(line: 75, column: 9, scope: !872)
!884 = distinct !{!884, !879, !885}
!885 = !DILocation(line: 75, column: 14, scope: !872)
!886 = !DILocation(line: 77, column: 2, scope: !857)
!887 = !DILocation(line: 78, column: 1, scope: !857)
!888 = distinct !DISubprogram(name: "strcmp", scope: !601, file: !601, line: 46, type: !889, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !600, retainedNodes: !565)
!889 = !DISubroutineType(types: !890)
!890 = !{!33, !136, !136}
!891 = !DILocalVariable(name: "s1", arg: 1, scope: !888, file: !601, line: 46, type: !136)
!892 = !DILocation(line: 0, scope: !888)
!893 = !DILocalVariable(name: "s2", arg: 2, scope: !888, file: !601, line: 46, type: !136)
!894 = !DILocation(line: 48, column: 2, scope: !888)
!895 = !DILocation(line: 48, column: 9, scope: !888)
!896 = !DILocation(line: 48, column: 16, scope: !888)
!897 = !DILocation(line: 48, column: 13, scope: !888)
!898 = !DILocation(line: 48, column: 19, scope: !888)
!899 = !DILocation(line: 49, column: 10, scope: !900)
!900 = distinct !DILexicalBlock(scope: !888, file: !601, line: 49, column: 7)
!901 = !DILocation(line: 49, column: 13, scope: !900)
!902 = !DILocation(line: 49, column: 7, scope: !888)
!903 = distinct !{!903, !894, !904}
!904 = !DILocation(line: 50, column: 13, scope: !888)
!905 = !DILocation(line: 50, column: 4, scope: !900)
!906 = !DILocation(line: 51, column: 39, scope: !888)
!907 = !DILocation(line: 51, column: 37, scope: !888)
!908 = !DILocation(line: 51, column: 2, scope: !888)
!909 = !DILocation(line: 52, column: 1, scope: !888)
!910 = distinct !DISubprogram(name: "mbedtls_memory_buffer_set_verify", scope: !3, file: !3, line: 489, type: !911, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !565)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !33}
!913 = !DILocalVariable(name: "verify", arg: 1, scope: !910, file: !3, line: 489, type: !33)
!914 = !DILocation(line: 0, scope: !910)
!915 = !DILocation(line: 491, column: 22, scope: !910)
!916 = !DILocalVariable(name: "buf_idx", scope: !910, file: !3, line: 491, type: !5)
!917 = !DILocation(line: 494, column: 19, scope: !910)
!918 = !DILocation(line: 494, column: 26, scope: !910)
!919 = !DILocation(line: 495, column: 1, scope: !910)
!920 = distinct !DISubprogram(name: "mbedtls_memory_buffer_alloc_verify", scope: !3, file: !3, line: 497, type: !921, scopeLine: 498, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !565)
!921 = !DISubroutineType(types: !922)
!922 = !{!33}
!923 = !DILocation(line: 499, column: 22, scope: !920)
!924 = !DILocalVariable(name: "buf_idx", scope: !920, file: !3, line: 499, type: !5)
!925 = !DILocation(line: 0, scope: !920)
!926 = !DILocation(line: 502, column: 12, scope: !920)
!927 = !DILocation(line: 502, column: 5, scope: !920)
!928 = distinct !DISubprogram(name: "verify_chain", scope: !3, file: !3, line: 175, type: !929, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !565)
!929 = !DISubroutineType(types: !930)
!930 = !{!33, !5}
!931 = !DILocalVariable(name: "buf_idx", arg: 1, scope: !928, file: !3, line: 175, type: !5)
!932 = !DILocation(line: 0, scope: !928)
!933 = !DILocation(line: 178, column: 40, scope: !928)
!934 = !DILocalVariable(name: "prv", scope: !928, file: !3, line: 178, type: !8)
!935 = !DILocation(line: 180, column: 13, scope: !936)
!936 = distinct !DILexicalBlock(scope: !928, file: !3, line: 180, column: 9)
!937 = !DILocation(line: 180, column: 21, scope: !936)
!938 = !DILocation(line: 180, column: 24, scope: !936)
!939 = !DILocation(line: 180, column: 45, scope: !936)
!940 = !DILocation(line: 180, column: 9, scope: !928)
!941 = !DILocation(line: 186, column: 9, scope: !942)
!942 = distinct !DILexicalBlock(scope: !936, file: !3, line: 181, column: 5)
!943 = !DILocation(line: 189, column: 23, scope: !944)
!944 = distinct !DILexicalBlock(scope: !928, file: !3, line: 189, column: 9)
!945 = !DILocation(line: 189, column: 30, scope: !944)
!946 = !DILocation(line: 189, column: 35, scope: !944)
!947 = !DILocation(line: 189, column: 9, scope: !928)
!948 = !DILocation(line: 195, column: 9, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !3, line: 190, column: 5)
!950 = !DILocalVariable(name: "cur", scope: !928, file: !3, line: 178, type: !8)
!951 = !DILocation(line: 200, column: 16, scope: !928)
!952 = !DILocation(line: 200, column: 5, scope: !928)
!953 = distinct !{!953, !952, !954}
!954 = !DILocation(line: 222, column: 5, scope: !928)
!955 = !DILocation(line: 202, column: 13, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !3, line: 202, column: 13)
!957 = distinct !DILexicalBlock(scope: !928, file: !3, line: 201, column: 5)
!958 = !DILocation(line: 202, column: 34, scope: !956)
!959 = !DILocation(line: 202, column: 13, scope: !957)
!960 = !DILocation(line: 208, column: 13, scope: !961)
!961 = distinct !DILexicalBlock(scope: !956, file: !3, line: 203, column: 9)
!962 = !DILocation(line: 211, column: 18, scope: !963)
!963 = distinct !DILexicalBlock(scope: !957, file: !3, line: 211, column: 13)
!964 = !DILocation(line: 211, column: 23, scope: !963)
!965 = !DILocation(line: 211, column: 13, scope: !957)
!966 = !DILocation(line: 217, column: 13, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !3, line: 212, column: 9)
!968 = !DILocation(line: 224, column: 5, scope: !928)
!969 = !DILocation(line: 225, column: 1, scope: !928)
!970 = distinct !DISubprogram(name: "verify_header", scope: !3, file: !3, line: 130, type: !971, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !565)
!971 = !DISubroutineType(types: !972)
!972 = !{!33, !8}
!973 = !DILocalVariable(name: "hdr", arg: 1, scope: !970, file: !3, line: 130, type: !8)
!974 = !DILocation(line: 0, scope: !970)
!975 = !DILocation(line: 132, column: 14, scope: !976)
!976 = distinct !DILexicalBlock(scope: !970, file: !3, line: 132, column: 9)
!977 = !DILocation(line: 132, column: 21, scope: !976)
!978 = !DILocation(line: 132, column: 9, scope: !970)
!979 = !DILocation(line: 137, column: 9, scope: !980)
!980 = distinct !DILexicalBlock(scope: !976, file: !3, line: 133, column: 5)
!981 = !DILocation(line: 140, column: 14, scope: !982)
!982 = distinct !DILexicalBlock(scope: !970, file: !3, line: 140, column: 9)
!983 = !DILocation(line: 140, column: 21, scope: !982)
!984 = !DILocation(line: 140, column: 9, scope: !970)
!985 = !DILocation(line: 145, column: 9, scope: !986)
!986 = distinct !DILexicalBlock(scope: !982, file: !3, line: 141, column: 5)
!987 = !DILocation(line: 148, column: 14, scope: !988)
!988 = distinct !DILexicalBlock(scope: !970, file: !3, line: 148, column: 9)
!989 = !DILocation(line: 148, column: 20, scope: !988)
!990 = !DILocation(line: 148, column: 9, scope: !970)
!991 = !DILocation(line: 153, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !988, file: !3, line: 149, column: 5)
!993 = !DILocation(line: 156, column: 14, scope: !994)
!994 = distinct !DILexicalBlock(scope: !970, file: !3, line: 156, column: 9)
!995 = !DILocation(line: 156, column: 19, scope: !994)
!996 = !DILocation(line: 156, column: 27, scope: !994)
!997 = !DILocation(line: 156, column: 48, scope: !994)
!998 = !DILocation(line: 156, column: 40, scope: !994)
!999 = !DILocation(line: 156, column: 9, scope: !970)
!1000 = !DILocation(line: 161, column: 9, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !994, file: !3, line: 157, column: 5)
!1002 = !DILocation(line: 164, column: 14, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !970, file: !3, line: 164, column: 9)
!1004 = !DILocation(line: 164, column: 24, scope: !1003)
!1005 = !DILocation(line: 164, column: 32, scope: !1003)
!1006 = !DILocation(line: 164, column: 58, scope: !1003)
!1007 = !DILocation(line: 164, column: 50, scope: !1003)
!1008 = !DILocation(line: 164, column: 9, scope: !970)
!1009 = !DILocation(line: 169, column: 9, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 165, column: 5)
!1011 = !DILocation(line: 172, column: 5, scope: !970)
!1012 = !DILocation(line: 173, column: 1, scope: !970)
!1013 = distinct !DISubprogram(name: "mbedtls_memory_buffer_alloc_init", scope: !3, file: !3, line: 559, type: !1014, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !565)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !21, !5}
!1016 = !DILocalVariable(name: "buf", arg: 1, scope: !1013, file: !3, line: 559, type: !21)
!1017 = !DILocation(line: 0, scope: !1013)
!1018 = !DILocalVariable(name: "len", arg: 2, scope: !1013, file: !3, line: 559, type: !5)
!1019 = !DILocation(line: 564, column: 5, scope: !1013)
!1020 = !DILocation(line: 566, column: 5, scope: !1013)
!1021 = !DILocation(line: 568, column: 9, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 568, column: 9)
!1023 = !DILocation(line: 568, column: 21, scope: !1022)
!1024 = !DILocation(line: 568, column: 9, scope: !1013)
!1025 = !DILocation(line: 572, column: 13, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 569, column: 5)
!1027 = !DILocation(line: 571, column: 13, scope: !1026)
!1028 = !DILocation(line: 573, column: 13, scope: !1026)
!1029 = !DILocation(line: 575, column: 5, scope: !1026)
!1030 = !DILocation(line: 578, column: 62, scope: !1013)
!1031 = !DILocalVariable(name: "single_buf_len", scope: !1013, file: !3, line: 562, type: !5)
!1032 = !DILocation(line: 581, column: 24, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 581, column: 9)
!1034 = !DILocation(line: 581, column: 9, scope: !1013)
!1035 = !DILocation(line: 584, column: 5, scope: !1013)
!1036 = !DILocalVariable(name: "buf_idx", scope: !1013, file: !3, line: 561, type: !5)
!1037 = !DILocation(line: 586, column: 5, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 586, column: 5)
!1039 = !DILocation(line: 587, column: 44, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 586, column: 75)
!1041 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 586, column: 5)
!1042 = !DILocation(line: 587, column: 33, scope: !1040)
!1043 = !DILocation(line: 587, column: 23, scope: !1040)
!1044 = !DILocation(line: 587, column: 27, scope: !1040)
!1045 = !DILocation(line: 588, column: 23, scope: !1040)
!1046 = !DILocation(line: 588, column: 27, scope: !1040)
!1047 = !DILocation(line: 590, column: 23, scope: !1040)
!1048 = !DILocation(line: 590, column: 29, scope: !1040)
!1049 = !DILocation(line: 591, column: 30, scope: !1040)
!1050 = !DILocation(line: 591, column: 35, scope: !1040)
!1051 = !DILocation(line: 592, column: 23, scope: !1040)
!1052 = !DILocation(line: 592, column: 30, scope: !1040)
!1053 = !DILocation(line: 592, column: 37, scope: !1040)
!1054 = !DILocation(line: 593, column: 23, scope: !1040)
!1055 = !DILocation(line: 593, column: 30, scope: !1040)
!1056 = !DILocation(line: 593, column: 37, scope: !1040)
!1057 = !DILocation(line: 594, column: 50, scope: !1040)
!1058 = !DILocation(line: 594, column: 23, scope: !1040)
!1059 = !DILocation(line: 594, column: 34, scope: !1040)
!1060 = !DILocation(line: 586, column: 63, scope: !1041)
!1061 = !DILocation(line: 586, column: 32, scope: !1041)
!1062 = distinct !{!1062, !1037, !1063}
!1063 = !DILocation(line: 595, column: 5, scope: !1038)
!1064 = !DILocation(line: 596, column: 1, scope: !1013)
!1065 = distinct !DISubprogram(name: "buffer_alloc_calloc", scope: !3, file: !3, line: 362, type: !1066, scopeLine: 363, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !565)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!20, !5, !5}
!1068 = !DILocalVariable(name: "n", arg: 1, scope: !1065, file: !3, line: 362, type: !5)
!1069 = !DILocation(line: 0, scope: !1065)
!1070 = !DILocalVariable(name: "size", arg: 2, scope: !1065, file: !3, line: 362, type: !5)
!1071 = !DILocation(line: 364, column: 22, scope: !1065)
!1072 = !DILocalVariable(name: "buf_idx", scope: !1065, file: !3, line: 364, type: !5)
!1073 = !DILocation(line: 367, column: 12, scope: !1065)
!1074 = !DILocation(line: 367, column: 5, scope: !1065)
!1075 = distinct !DISubprogram(name: "buffer_alloc_free", scope: !3, file: !3, line: 481, type: !1076, scopeLine: 482, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !565)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !20}
!1078 = !DILocalVariable(name: "ptr", arg: 1, scope: !1075, file: !3, line: 481, type: !20)
!1079 = !DILocation(line: 0, scope: !1075)
!1080 = !DILocation(line: 483, column: 22, scope: !1075)
!1081 = !DILocalVariable(name: "buf_idx", scope: !1075, file: !3, line: 483, type: !5)
!1082 = !DILocation(line: 486, column: 5, scope: !1075)
!1083 = !DILocation(line: 487, column: 1, scope: !1075)
!1084 = distinct !DISubprogram(name: "buffer_alloc_free_with_buf", scope: !3, file: !3, line: 370, type: !1085, scopeLine: 371, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !565)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !5, !20}
!1087 = !DILocalVariable(name: "buf_idx", arg: 1, scope: !1084, file: !3, line: 370, type: !5)
!1088 = !DILocation(line: 0, scope: !1084)
!1089 = !DILocalVariable(name: "ptr", arg: 2, scope: !1084, file: !3, line: 370, type: !20)
!1090 = !DILocalVariable(name: "old", scope: !1084, file: !3, line: 372, type: !8)
!1091 = !DILocalVariable(name: "p", scope: !1084, file: !3, line: 373, type: !21)
!1092 = !DILocation(line: 375, column: 13, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 375, column: 9)
!1094 = !DILocation(line: 375, column: 21, scope: !1093)
!1095 = !DILocation(line: 375, column: 38, scope: !1093)
!1096 = !DILocation(line: 375, column: 42, scope: !1093)
!1097 = !DILocation(line: 375, column: 50, scope: !1093)
!1098 = !DILocation(line: 375, column: 67, scope: !1093)
!1099 = !DILocation(line: 375, column: 73, scope: !1093)
!1100 = !DILocation(line: 375, column: 9, scope: !1084)
!1101 = !DILocation(line: 387, column: 7, scope: !1084)
!1102 = !DILocation(line: 388, column: 11, scope: !1084)
!1103 = !DILocalVariable(name: "hdr", scope: !1084, file: !3, line: 372, type: !8)
!1104 = !DILocation(line: 392, column: 14, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 392, column: 9)
!1106 = !DILocation(line: 401, column: 16, scope: !1084)
!1107 = !DILocation(line: 410, column: 14, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 410, column: 9)
!1109 = !DILocation(line: 410, column: 19, scope: !1108)
!1110 = !DILocation(line: 410, column: 27, scope: !1108)
!1111 = !DILocation(line: 410, column: 41, scope: !1108)
!1112 = !DILocation(line: 410, column: 47, scope: !1108)
